; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_9_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 - counter
	)
  (:init
		(= (value c0) 54)
	(= (value c1) 10)
	(= (value c2) 65)
	(= (value c3) 80)
	(= (value c4) 81)
	(= (value c5) 75)
	(= (value c6) 83)
	(= (value c7) 72)
	(= (value c8) 45)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
		)
	)
)

; plan
1. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 4 of 8
2. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 4 of 8
3. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 4 of 8
4. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 4 of 8
5. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 4 of 8
6. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 4 of 8
7. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 4 of 8
8. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 4 of 8
9. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 4 of 8
10. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 4 of 8
11. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 4 of 8
12. (increment c8)
   changed: (value c8) from 45 to 51
   goals met: 4 of 8
13. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 8
14. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 8
15. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 8
16. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 8
17. (increment c5)
   changed: (value c5) from 75 to 79
   goals met: 4 of 8
18. (increment c8)
   changed: (value c8) from 51 to 57
   goals met: 4 of 8
19. (increment c8)
   changed: (value c8) from 57 to 63
   goals met: 4 of 8
20. (increment c8)
   changed: (value c8) from 63 to 69
   goals met: 4 of 8
21. (increment c8)
   changed: (value c8) from 69 to 75
   goals met: 5 of 8
22. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 5 of 8
23. (increment c7)
   changed: (value c7) from 72 to 78
   goals met: 4 of 8
24. (increment c8)
   changed: (value c8) from 75 to 81
   goals met: 5 of 8
25. (increment c7)
   changed: (value c7) from 78 to 84
   goals met: 5 of 8
26. (increment c8)
   changed: (value c8) from 81 to 87
   goals met: 6 of 8
27. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 6 of 8
28. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 6 of 8
29. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 6 of 8
30. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 6 of 8
31. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 6 of 8
32. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 6 of 8
33. (increment c1)
   changed: (value c1) from 10 to 16
   goals met: 6 of 8
34. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 6 of 8
35. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 6 of 8
36. (increment c1)
   changed: (value c1) from 16 to 24
   goals met: 6 of 8
37. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 6 of 8
38. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 6 of 8
39. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 6 of 8
40. (increment c1)
   changed: (value c1) from 24 to 33
   goals met: 6 of 8
41. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 6 of 8
42. (increment c1)
   changed: (value c1) from 33 to 43
   goals met: 6 of 8
43. (increment c1)
   changed: (value c1) from 43 to 53
   goals met: 6 of 8
44. (increment c1)
   changed: (value c1) from 53 to 63
   goals met: 7 of 8
45. (decrement_rate c5)
   changed: (rate_value c5) from 4 to 3
   goals met: 7 of 8
46. (increment c5)
   changed: (value c5) from 79 to 82
   goals met: 8 of 8
